{
  "project": "RalphCLI",
  "branchName": "ralph/pypi-packaging",
  "description": "PyPI packaging pipeline with Trusted Publishers, version consistency CI, tag-triggered releases, and branch protection automation",
  "userStories": [
    {
      "id": "US-001",
      "title": "Add package metadata to pyproject.toml",
      "description": "As a maintainer, I want proper PyPI classifiers and project URLs in pyproject.toml so that the package is discoverable and well-documented on PyPI.",
      "acceptanceCriteria": [
        "Add classifiers for Python 3.11, 3.12, 3.13, MIT license, and Development Tools topic",
        "Add project.urls with Homepage, Repository, Changelog, and Issue Tracker links pointing to the GitHub repo",
        "uv build produces a valid sdist and wheel with the ralph-cli package name",
        "Typecheck passes",
        "Tests pass"
      ],
      "priority": 1,
      "passes": true,
      "notes": "Added classifiers for Python 3.11/3.12/3.13, MIT license, and Development Tools topics. Added project.urls with Homepage, Repository, Changelog, and Issue Tracker. uv build produces valid sdist and wheel."
    },
    {
      "id": "US-002",
      "title": "Add version consistency check to CI",
      "description": "As a maintainer, I want CI to verify version consistency across pyproject.toml, __init__.py, and CHANGELOG.md on every PR so that version mismatches are caught before merging.",
      "acceptanceCriteria": [
        "Add a version-check job to .github/workflows/ci.yml that runs on push to main and PRs targeting main",
        "Job verifies pyproject.toml version matches src/ralph/__init__.py __version__",
        "Job verifies CHANGELOG.md contains an entry header matching the current version (e.g., ## [2.1.0])",
        "Job fails with a clear error message identifying which files have mismatched versions",
        "Job runs without installing project dependencies (uses grep/python one-liners only)",
        "Lint passes"
      ],
      "priority": 2,
      "passes": true,
      "notes": "Added version-check job to ci.yml. Uses python3 one-liners to extract versions from pyproject.toml and __init__.py, grep to check CHANGELOG.md. Clear error messages via GitHub Actions ::error annotations."
    },
    {
      "id": "US-003",
      "title": "Add tag-version validation to version check",
      "description": "As a maintainer, I want the version check to also validate that git tags match the pyproject.toml version so that tag typos are caught before publishing.",
      "acceptanceCriteria": [
        "Extend the version-check job to also trigger on tag pushes matching v*",
        "On tag-triggered runs, verify the git tag (e.g., v2.1.0) matches the pyproject.toml version (e.g., 2.1.0)",
        "Job fails with a clear error message when tag and pyproject.toml versions do not match",
        "Job passes silently on non-tag runs (push/PR) where no tag validation is needed",
        "Lint passes"
      ],
      "priority": 3,
      "passes": true,
      "notes": "Extended CI push trigger with tags: ['v*']. Added conditional step using startsWith(github.ref, 'refs/tags/v') that strips v prefix and compares to pyproject.toml version. Step is skipped on non-tag runs."
    },
    {
      "id": "US-004",
      "title": "Create publish workflow with build and TestPyPI jobs",
      "description": "As a maintainer, I want a publish workflow that builds the package and uploads to TestPyPI on tag pushes so that package integrity is validated before production release.",
      "acceptanceCriteria": [
        "Create .github/workflows/publish.yml triggered on tag pushes matching v*",
        "Workflow uses minimal permissions with id-token: write for OIDC and contents: write for releases",
        "Add a build job that runs uv build and uploads the dist/ artifacts",
        "Add a testpypi job that downloads the artifacts and publishes to TestPyPI using pypa/gh-action-pypi-publish with Trusted Publishers (OIDC)",
        "testpypi job depends on build job completing successfully",
        "All action versions are pinned to full commit SHAs"
      ],
      "priority": 4,
      "passes": true,
      "notes": "Created publish.yml with build job (uv build + upload-artifact) and testpypi job (download-artifact + pypa/gh-action-pypi-publish with OIDC). All 5 action versions pinned to full commit SHAs. Workflow-level permissions: id-token: write, contents: write."
    },
    {
      "id": "US-005",
      "title": "Add production PyPI publish job to workflow",
      "description": "As a maintainer, I want the publish workflow to upload to production PyPI after TestPyPI succeeds so that releases are validated before going live.",
      "acceptanceCriteria": [
        "Add a pypi job to publish.yml that publishes to production PyPI using pypa/gh-action-pypi-publish with Trusted Publishers (OIDC)",
        "pypi job depends on testpypi job completing successfully",
        "pypi job uses a separate GitHub Actions environment named pypi for deployment protection",
        "Action version is pinned to a full commit SHA",
        "Lint passes"
      ],
      "priority": 5,
      "passes": true,
      "notes": "Added pypi job to publish.yml with needs: testpypi, environment: pypi, id-token: write permission, and pypa/gh-action-pypi-publish pinned to full commit SHA. Production PyPI is the default target (no repository-url override)."
    },
    {
      "id": "US-006",
      "title": "Add GitHub Release creation job to workflow",
      "description": "As a maintainer, I want a GitHub Release to be automatically created with changelog notes when a tag is published so that users can see what changed.",
      "acceptanceCriteria": [
        "Add a release job to publish.yml that runs after the pypi job succeeds",
        "Job extracts the release notes section from CHANGELOG.md for the tagged version",
        "Job creates a GitHub Release using gh release create or softprops/action-gh-release with the extracted notes as body",
        "Release is marked as latest for stable versions (no pre-release suffix)",
        "The sdist and wheel artifacts are attached to the GitHub Release",
        "Lint passes"
      ],
      "priority": 6,
      "passes": true,
      "notes": "Added release job to publish.yml with needs: pypi. Uses gh release create with extracted CHANGELOG.md notes, --latest for stable versions and --prerelease for pre-release suffixes. Downloads and attaches dist/ artifacts (sdist + wheel) to the GitHub Release."
    },
    {
      "id": "US-007",
      "title": "Gate publish workflow on CI checks passing",
      "description": "As a maintainer, I want the publish workflow to only proceed if all CI checks pass so that broken code is never published to PyPI.",
      "acceptanceCriteria": [
        "Add a ci-check job at the start of publish.yml that waits for the CI workflow to complete successfully on the same commit",
        "The build job depends on ci-check completing successfully",
        "If CI has not run or has failed, the publish workflow fails early with a clear message",
        "Lint passes"
      ],
      "priority": 7,
      "passes": true,
      "notes": "Added ci-check job to publish.yml that polls CI workflow via gh api for the same commit SHA. Build job now depends on ci-check. Three failure modes with ::error annotations: CI not run, CI failed, CI still running after timeout."
    },
    {
      "id": "US-008",
      "title": "Create branch protection setup script",
      "description": "As a maintainer, I want a script that configures branch protection rules for main via gh api so that the repository is secured consistently.",
      "acceptanceCriteria": [
        "Create scripts/setup-branch-protection.sh that configures branch protection for main using gh api",
        "Script requires PR reviews (at least 1 approval) before merging",
        "Script requires status checks (CI test matrix, version-check, CodeQL) to pass before merging",
        "Script requires branches to be up to date before merging",
        "Script prevents force pushes to main",
        "Script is executable and includes usage documentation in comments"
      ],
      "priority": 8,
      "passes": true,
      "notes": "Created scripts/setup-branch-protection.sh using gh api PUT. Requires 1 PR approval, all 6 CI matrix checks + version-check + CodeQL Analysis, strict up-to-date, no force pushes. Script is executable with full usage docs in comments."
    },
    {
      "id": "US-009",
      "title": "Document Trusted Publisher setup steps",
      "description": "As a maintainer, I want a setup guide documenting the one-time PyPI and TestPyPI Trusted Publisher configuration so that the OIDC workflow can be activated.",
      "acceptanceCriteria": [
        "Add a PUBLISHING.md file (or section in README.md) documenting the Trusted Publisher setup steps for PyPI and TestPyPI",
        "Document the required PyPI project name (ralph-cli), GitHub repository, workflow file name, and environment name",
        "Document the TestPyPI configuration separately with its own project name and settings",
        "Include a quick-start checklist for first-time setup",
        "Lint passes"
      ],
      "priority": 9,
      "passes": false,
      "notes": ""
    }
  ]
}
